app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
---
    <%= link_to gravatar_for(user, size: 150), user %> </h5>
    <p class="card-text"><%= pluralize(user.articles.count, "article") %></p>