app/controllers/articles_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "fsdfsfsf"], ["description", "sdfsdfsdfsdf"], ["created_at", "2022-07-14 20:12:16.536287"], ["updated_at", "2022-07-14 20:12:16.536287"], ["user_id", 3]]
---
  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save