app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-18 21:04:38.230691"], ["password_digest", "[FILTERED]"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)